driver-tests/bpelse/faulthandling/FaultHandlingJbi/test/fhw3c10Invoke/Output.xml

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/"><SOAP-ENV:Header/><SOAP-ENV:Body><item xmlns="http://stc.com/FaultTestw3xC"><retString>Scenario Caught By Process FaultName Handler</retString></item></SOAP-ENV:Body></SOAP-ENV:Envelope>